# Виселица

import random

# константы
HANGMAN = (
    """
    ------
    |    |
    |
    |
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    O
    |
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    O
    |   -+-
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    O
    |  /-+-/
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    O
    |  /-+-/
    |    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    O
    |  /-+-/
    |    |
    |    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    O
    |  /-+-/
    |    |
    |    |
    |   | |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    O
    |  /-+-/
    |    |
    |    |
    |   | |
    |   | |
    |
    ----------
    """
)

MAX_WRONG = len(HANGMAN) - 1

WORDS = ("толерантность", "эксгумация", "либерализм", "экспонат", "пышность", "кимпиляция", "шаловливость",
         "экспозиция", "индульгенция" , "контрацептив", "шкворень", "эпиграф", "эпитафия", "барбекю", "жульен",
         "энцефалопатия", "парашютист", "импозантность", "индифферент", "демультипликатор", "педикулёз", "выхухоль",
         "россомаха", "сущность", "поэтапность", "напыщенность", "возвышенность", "длинношеее")

# слово для отгадывания
word = random.choice(WORDS)

# по одному дефису на каждую букву которую надо отгадать
so_far = "-" * len(word)

# количество ошибок, которые сделал игрок
wrong = 0

# буквы, которые назвал игрок
used = []

print("Добро пожаловать в игру 'Виселица'. Удачи вам!")
while wrong < MAX_WRONG and so_far != word:
    print(HANGMAN[wrong])
    print("Вы уже предлагали следующие буквы:\n", used)
    print("Отгаданное вами в слове сейчас выглядит так:\n", so_far)

    guess = input("Введите букву: ")
    guess = guess.lower()
    while guess in used:
        print("Вы уже предлагали букву", guess)
        guess = input("Введите букву: ")
        guess = guess.lower()
    used.append(guess)

    if guess in word:
        print("Да! Буква", guess, "есть в слове!")

        # новая строка so_far  с отгаданной буквой или буквами
        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new
    else:
        print("К сожалению, буквы", guess, "нет в слове.")
        wrong += 1

if wrong == MAX_WRONG:
    print(HANGMAN[wrong])
    print("Вас повесили!")
else:
    print("Вы отгадали!")

print("Было загадано слово", word)
